lkolbly/cmsis-svd/data/Renesas/R7FA4W1A.svd
                <register>
                    <name>LVCMPCR</name>
                    <description>Voltage Monitor Circuit Control Register</description>
                    <addressOffset>0x417</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LVD2E</name>
                            <description>Voltage Detection 2 Enable</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage detection 2 circuit disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage detection 2 circuit enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1E</name>
                            <description>Voltage Detection 1 Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage detection 1 circuit disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage detection 1 circuit enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>2</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00. The write value should be 00.</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LVDLVLR</name>
                    <description>Voltage Detection Level Select Register</description>
                    <addressOffset>0x418</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x07</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LVD2LVL</name>
                            <description>Voltage Detection 2 Level Select (Standard voltage during drop in voltage)</description>
                            <lsb>5</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000</name>
                                    <description>4.29V (Vdet2_0)</description>
                                    <value>#000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001</name>
                                    <description>4.14V (Vdet2_1)</description>
                                    <value>#001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010</name>
                                    <description>4.02V (Vdet2_2)</description>
                                    <value>#010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011</name>
                                    <description>3.84V (Vdet2_3)</description>
                                    <value>#011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>LVD1LVL</name>
                            <description>Voltage Detection 1 Level Select (Standard voltage during drop in voltage)</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>4.29V (Vdet1_0)</description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001</name>
                                    <description>4.14V (Vdet1_1)</description>
                                    <value>#00001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00010</name>
                                    <description>4.02V (Vdet1_2)</description>
                                    <value>#00010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00011</name>
                                    <description>3.84V (Vdet1_3)</description>
                                    <value>#00011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00100</name>
                                    <description>3.10V (Vdet1_4)</description>
                                    <value>#00100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101</name>
                                    <description>3.00V (Vdet1_5)</description>
                                    <value>#00101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00110</name>
                                    <description>2.90V (Vdet1_6)</description>
                                    <value>#00110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00111</name>
                                    <description>2.79V (Vdet1_7)</description>
                                    <value>#00111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01000</name>
                                    <description>2.68V (Vdet1_8)</description>
                                    <value>#01000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01001</name>
                                    <description>2.58V (Vdet1_9)</description>
                                    <value>#01001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01010</name>
                                    <description>2.48V (Vdet1_A)</description>
                                    <value>#01010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01011</name>
                                    <description>2.20V (Vdet1_B)</description>
                                    <value>#01011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01100</name>
                                    <description>1.96V (Vdet1_C)</description>
                                    <value>#01100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01101</name>
                                    <description>1.86V (Vdet1_D)</description>
                                    <value>#01101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110</name>
                                    <description>1.75V (Vdet1_E)</description>
                                    <value>#01110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01111</name>
                                    <description>1.65V (Vdet1_F)</description>
                                    <value>#01111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x1</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>LVD%sCR0</name>
                    <description>Voltage Monitor %s Circuit Control Register 0</description>
                    <addressOffset>0x41A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x80</resetValue>
                    <resetMask>0xF7</resetMask>
                    <fields>
                        <field>
                            <name>RN</name>
                            <description>Voltage Monitor Reset Negate Select</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Negation follows a stabilization time (tLVD) after VCC &gt; Vdet1 is detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Negation follows a stabilization time (tLVD) after assertion of the LVD reset.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>RI</name>
                            <description>Voltage Monitor Circuit Mode Select</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage Monitor  interrupt during Vdet1 passage</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage Monitor  reset enabled when the voltage falls to and below Vdet1</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>3</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CMPE</name>
                            <description>Voltage Monitor Circuit Comparison Result Output Enable</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Voltage Monitor circuit comparison result output disabled.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Voltage Monitor circuit comparison result output enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RIE</name>
                            <description>Voltage Monitor Interrupt/Reset Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x2</dimIncrement>
                    <dimIndex>1,2</dimIndex>
                    <name>LVD%sCR1</name>
                    <description>Voltage Monitor %s Circuit Control Register 1</description>
                    <addressOffset>0x0E0</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 00000. The write value should be 00000.</description>
                            <lsb>3</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IRQSEL</name>
                            <description>Voltage Monitor Interrupt Type Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Non-maskable interrupt</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Maskable interrupt</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IDTSEL</name>
                            <description>Voltage Monitor Interrupt Generation Condition Select</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>When VCC&gt;=Vdet (rise) is detected</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>When VCC&lt;Vdet (drop) is detected</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>When drop and rise are detected</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Settings prohibited</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
