lkolbly/cmsis-svd/data/Renesas/R7FA4W1A.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT2</name>
            <description>Port 2 Control Registers</description>
            <baseAddress>0x40040040</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT3</name>
            <description>Port 3 Control Registers</description>
            <baseAddress>0x40040060</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT1">
            <name>PORT4</name>
            <description>Port 4 Control Registers</description>
            <baseAddress>0x40040080</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT5</name>
            <description>Port 5 Control Registers</description>
            <baseAddress>0x400400A0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT6</name>
            <description>Port 6 Control Registers</description>
            <baseAddress>0x400400C0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT7</name>
            <description>Port 7 Control Registers</description>
            <baseAddress>0x400400E0</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT8</name>
            <description>Port 8 Control Registers</description>
            <baseAddress>0x40040100</baseAddress>
        </peripheral>
        <peripheral derivedFrom="PORT0">
            <name>PORT9</name>
            <description>Port 9 Control Registers</description>
            <baseAddress>0x40040120</baseAddress>
        </peripheral>
        <peripheral>
            <name>PFS</name>
            <description>Pmn Pin Function Control Register</description>
            <baseAddress>0x40040800</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x02</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x03</offset>
                <size>37</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x06</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x07</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x28</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2A</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x2B</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x40</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x42</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x43</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x60</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x62</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x63</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x66</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x67</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6A</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6B</offset>
                <size>21</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6E</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x6F</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x80</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x82</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x83</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x86</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x87</offset>
                <size>21</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8A</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x8B</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB0</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB2</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xB3</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC0</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC2</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC3</offset>
                <size>37</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC6</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xC7</offset>
                <size>36</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xE8</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xEA</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0xEB</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x102</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x103</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x120</offset>
                <size>4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x122</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x123</offset>
                <size>5</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x126</offset>
                <size>2</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x127</offset>
                <size>25</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x12A</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x12B</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x140</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x142</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x143</offset>
                <size>32</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x16C</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x16E</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x16F</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x180</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x182</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x183</offset>
                <size>28</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A0</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A2</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A3</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1A8</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1AA</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1AB</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C0</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C2</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1C3</offset>
                <size>24</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E0</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E2</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E3</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1E8</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1EA</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x1EB</offset>
                <size>16</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x200</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x202</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x203</offset>
                <size>40</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x240</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x242</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x243</offset>
                <size>12</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x278</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x27A</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x27B</offset>
                <size>8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>P000PFS</name>
                    <description>P000 Pin Function Control Register</description>
                    <addressOffset>0x000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFD</resetMask>
                    <fields>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>29</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PSEL</name>
                            <description>Port Function SelectThese bits select the peripheral function. For individual pin functions, see the MPC table</description>
                            <lsb>24</lsb>
                            <msb>28</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 0000000. The write value should be 0000000.</description>
                            <lsb>17</lsb>
                            <msb>23</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PMR</name>
                            <description>Port Mode Control</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Uses the pin as a general I/O pin. </description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Uses the pin as an I/O port for peripheral functions.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ASEL</name>
                            <description>Analog Input enable</description>
                            <lsb>15</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Used other than as analog pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Used as analog pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ISEL</name>
                            <description>IRQ input enable</description>
                            <lsb>14</lsb>
                            <msb>14</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Not used as IRQn input pin</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Used as IRQn input pin</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EOF</name>
                            <description>Event on Failing</description>
                            <lsb>13</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Detect failing edge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EOR</name>
                            <description>Event on Rising</description>
                            <lsb>12</lsb>
                            <msb>12</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>No effected</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Detect rising edge</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>This bit is read as 0. The write value should be 0.</description>
                            <lsb>11</lsb>
                            <msb>11</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DSCR</name>
                            <description>Port Drive Capability</description>
                            <lsb>10</lsb>
                            <msb>10</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Low drive</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Middle drive.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>These bits are read as 000. The write value should be 000.</description>
                            <lsb>7</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NCODR</name>
                            <description>N-Channel Open Drain Control</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
