lkolbly/cmsis-svd/data/Renesas/R7FA4W1A.svd
                <register>
                    <name>LCDC0</name>
                    <description>LCD Clock Control Register 0 </description>
                    <addressOffset>0x002</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>LCDC</name>
                            <description>LCD clock (LCDCL)</description>
                            <lsb>0</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>000001</name>
                                    <description>(Sub clock)/22  or  (LOCO clock)/22</description>
                                    <value>#000001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000010</name>
                                    <description>(Sub clock)/23  or  (LOCO clock)/23</description>
                                    <value>#000010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000011</name>
                                    <description>(Sub clock)/24  or  (LOCO clock)/24 </description>
                                    <value>#000011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000100</name>
                                    <description>(Sub clock)/25  or  (LOCO clock)/25 </description>
                                    <value>#000100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000101</name>
                                    <description>(Sub clock)/26  or  (LOCO clock)/26 </description>
                                    <value>#000101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000110</name>
                                    <description>(Sub clock)/27  or  (LOCO clock)/27</description>
                                    <value>#000110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>000111</name>
                                    <description>(Sub clock)/28  or  (LOCO clock)/28</description>
                                    <value>#000111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001000</name>
                                    <description>(Sub clock)/29  or  (LOCO clock)/29</description>
                                    <value>#001000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>001001</name>
                                    <description>(Sub clock)/210 or  (LOCO clock)/210</description>
                                    <value>#001001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010001</name>
                                    <description>(Main clock)/28 or  (HOCO clock)/28 </description>
                                    <value>#010001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010010</name>
                                    <description>(Main clock)/29 or  (HOCO clock)/29</description>
                                    <value>#010010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010011</name>
                                    <description>(Main clock)/210 or  (HOCO clock)/210</description>
                                    <value>#010011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010100</name>
                                    <description>(Main clock)/211 or  (HOCO clock)/211</description>
                                    <value>#010100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010101</name>
                                    <description>(Main clock)/212 or  (HOCO clock)/212</description>
                                    <value>#010101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010110</name>
                                    <description>(Main clock)/213 or  (HOCO clock)/213 </description>
                                    <value>#010110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>010111</name>
                                    <description>(Main clock)/214 or  (HOCO clock)/214</description>
                                    <value>#010111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011000</name>
                                    <description>(Main clock)/215 or  (HOCO clock)/215</description>
                                    <value>#011000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011001</name>
                                    <description>(Main clock)/216 or  (HOCO clock)/216</description>
                                    <value>#011001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011010</name>
                                    <description>(Main clock)/217 or  (HOCO clock)/217</description>
                                    <value>#011010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>011011</name>
                                    <description>(Main clock)/218 or  (HOCO clock)/218</description>
                                    <value>#011011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>101011</name>
                                    <description>(Main clock)/219 or  (HOCO clock)/219</description>
                                    <value>#101011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Other than above Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>VLCD</name>
                    <description>LCD Boost Level Control Register </description>
                    <addressOffset>0x003</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x04</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>VLCD</name>
                            <description>Reference Voltage(Contrast Adjustment) Select</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00100</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.00 V (default)  VL4 voltage:  3.00 V(1/3 bias method)/4.00 V(1/4 bias method)</description>
                                    <value>#00100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.05 V    VL4 voltage:  3.15 V(1/3 bias method)/4.20 V(1/4 bias method)</description>
                                    <value>#00101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00110</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.10 V    VL4 voltage:  3.30 V(1/3 bias method)/4.40 V(1/4 bias method)</description>
                                    <value>#00110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00111</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.15 V   VL4 voltage:  3.45 V(1/3 bias method)/4.60 V(1/4 bias method)</description>
                                    <value>#00111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01000</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.20 V    VL4 voltage:  3.60 V(1/3 bias method)/4.80 V(1/4 bias method)</description>
                                    <value>#01000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01001</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.25 V    VL4 voltage:  3.75 V(1/3 bias method)/5.00 V(1/4 bias method)</description>
                                    <value>#01001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01010</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.30 V    VL4 voltage:  3.90 V(1/3 bias method)/5.20 V(1/4 bias method)</description>
                                    <value>#01010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01011</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.35 V    VL4 voltage:  4.05 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                                    <value>#01011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01100</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.40 V    VL4 voltage:  4.20 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                                    <value>#01100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01101</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.45 V    VL4 voltage:  4.35 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                                    <value>#01101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.50 V    VL4 voltage:  4.50 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                                    <value>#01110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01111</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.55 V    VL4 voltage:  4.65 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                                    <value>#01111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10000</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.60 V   VL4 voltage:  4.80 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                                    <value>#10000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10001</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.65 V   VL4 voltage:  4.95 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                                    <value>#10001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10010</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.70 V   VL4 voltage:  5.10 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                                    <value>#10010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10011</name>
                                    <description>Reference voltageselection(contrast adjustment):  1.75 V   VL4 voltage:  5.25 V(1/3 bias method)/Setting prohibited(1/4 bias method)</description>
                                    <value>#10011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Setting prohibited</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>54</dim>
                    <dimIncrement>0x1</dimIncrement>
                    <dimIndex>0-53</dimIndex>
                    <name>SEG%s</name>
                    <description>LCD Display Data Register %s</description>
                    <addressOffset>0x100</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xFF</resetMask>
                    <fields>
                        <field>
                            <name>SEG</name>
                            <description>LCD Display Data</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
